---
kind: method
id: M:Autodesk.Revit.DB.ReferenceIntersector.Dispose
zh: 射线、射线相交
source: html/4bad58d0-1ed4-176b-81cc-3a0181744ebe.htm
---
# Autodesk.Revit.DB.ReferenceIntersector.Dispose Method

**中文**: 射线、射线相交

Releases all resources used by the ReferenceIntersector

## Syntax (C#)
```csharp
public void Dispose()
```